#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```terraform

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/utf9k-net/infrastructure/runs/run-SXWXXH1rtVyD6MZC

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.utf9k-net-zone: Refreshing state... [id=2117c58a86ea651fc35e585881e42c6e]
cloudflare_pages_project.utf9k-net: Refreshing state... [id=utf9k]
cloudflare_worker_script.statistician: Refreshing state... [id=statistician]
cloudflare_pages_project.dotfiles-utf9k-net: Refreshing state... [id=9kdotfiles]
cloudflare_pages_project.towing-utf9k-net: Refreshing state... [id=9ktowing]
cloudflare_pages_project.october-utf9k-net: Refreshing state... [id=9koctober]
cloudflare_record.txt-keybase-utf9k-net: Refreshing state... [id=dc332e512c0513dd7c367876a6379122]
cloudflare_record.mx-smtp20-utf9k-net: Refreshing state... [id=7a4606d9a1aefb24b5d2bd309c17e952]
cloudflare_record.cname-fm3-domainkey-utf9k-net: Refreshing state... [id=93c4b00c35affa11f9b45f91c8266894]
cloudflare_record.srv-caldav-tcp-utf9k-net: Refreshing state... [id=e76146833b768e57a2a4c248cb0bcc73]
cloudflare_record.srv-jmap-tcp-utf9k-net: Refreshing state... [id=ad31baf51c1659b0b834ddf265d0ff3d]
cloudflare_record.cname-mail-utf9k-net: Refreshing state... [id=145551e8b3e6f5edc07b931f9d53e160]
cloudflare_record.txt-google2-utf9k-net: Refreshing state... [id=465910dbdc3e273ffb14f30424505b0d]
cloudflare_record.txt-acme-utf9k-net: Refreshing state... [id=daf149cb728844cfc76568127a0aae9d]
cloudflare_record.srv-pop3s-tcp-utf9k-net: Refreshing state... [id=3a2660076dfe6aeaf8993f0f90e747ab]
cloudflare_record.cname-mesmtp-domainkey-utf9k-net: Refreshing state... [id=6fd876614206400d83c5c5e654d44f51]
cloudflare_record.srv-carddavs-tcp-utf9k-net: Refreshing state... [id=2f89b45ce65bd23302c6a438368f1149]
cloudflare_record.txt-greeting-utf9k-net: Refreshing state... [id=fac09784411173d14f631d11ff744067]
cloudflare_record.srv-pop3-tcp-utf9k-net: Refreshing state... [id=eaa1a8c68f8bf87608a5dd1812be95eb]
cloudflare_record.cname-www-utf9k-net: Refreshing state... [id=9701e4644ba228fafb5a4bbe5cac866d]
cloudflare_record.txt-spf-utf9k-net: Refreshing state... [id=b110f7bf82a29a2dc574a6e92ac40bb5]
cloudflare_record.srv-carddav-tcp-utf9k-net: Refreshing state... [id=720297e96528ceb079814cf06e028273]
cloudflare_record.mx-smtp10-utf9k-net: Refreshing state... [id=b155ccf0a0ea580a96e7012109f033e2]
cloudflare_record.srv-caldavs-tcp-utf9k-net: Refreshing state... [id=85757a10cce1e727834134b37033cbb4]
cloudflare_record.cname-fm2-domainkey-utf9k-net: Refreshing state... [id=3e92760847f6659c7844e047d90a23b4]
cloudflare_record.cname-img-utf9k-net: Refreshing state... [id=37bc3aa0bc2bbe4660866a2bc2fb6641]
cloudflare_record.txt-acme-www-utf9k-net: Refreshing state... [id=828301552a161512968060d4c43433b6]
cloudflare_record.txt-google1-utf9k-net: Refreshing state... [id=6d05657658a9e2e94c515f45509521ba]
cloudflare_record.cname-gunslinger-utf9k-net: Refreshing state... [id=ad478acbb03d0321ecd25bb176c27a70]
cloudflare_record.srv-imaps-tcp-utf9k-net: Refreshing state... [id=5bbcfae88db47480c42d924f58613d8c]
cloudflare_record.cname-fm1-domainkey-utf9k-net: Refreshing state... [id=de4265ad72f9bf3b663b4ead2cde46e7]
cloudflare_record.srv-submission-tcp-utf9k-net: Refreshing state... [id=1be4f635e1e8449ff227cd3301073ed1]
cloudflare_record.srv-imap-tcp-utf9k-net: Refreshing state... [id=a1ac18bbb58b89a48f3142549b4e840b]
cloudflare_pages_domain.www-utf9k-net: Refreshing state... [id=8cac173c-328b-4b82-bf7d-45b3dd75b294]
cloudflare_record.cname-utf9k-net: Refreshing state... [id=66e1df45de81d9a1c4dae646806e1375]
cloudflare_pages_domain.utf9k-net: Refreshing state... [id=28cfc87f-a8b2-4dca-b348-6cb124c5d143]
cloudflare_record.cname-october-utf9k-net: Refreshing state... [id=52a600cc239f469b94be08c70e6b920a]
cloudflare_pages_domain.october-utf9k-net: Refreshing state... [id=2ff6f737-e73a-43cb-af01-3403c3c13804]
cloudflare_pages_domain.towing-utf9k-net: Refreshing state... [id=c574f355-bc64-426f-925a-82e3af56d50b]
cloudflare_record.cname-towing-utf9k-net: Refreshing state... [id=72d82dd8bf83abf32a703b404ba87530]
cloudflare_pages_domain.dotfiles-utf9k-net: Refreshing state... [id=ce5d1a6b-e7a0-44dd-9de8-5f397de2ff73]
cloudflare_record.cname-dotfiles-utf9k-net: Refreshing state... [id=d8b406c97dd4ffca6b9ddaeb12e42524]
cloudflare_worker_route.utf9k: Refreshing state... [id=01ed29434bbc41739c378626296d940d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.a-home-utf9k-net will be created
  + resource "cloudflare_record" "a-home-utf9k-net" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "home.utf9k.net"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + value           = "158.140.244.234"
      + zone_id         = (known after apply)
    }

  # cloudflare_zone.home-utf9k-net-zone will be created
  + resource "cloudflare_zone" "home-utf9k-net-zone" {
      + account_id          = "8e782a355544971b192db9e75d789dca"
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + paused              = false
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + verification_key    = (known after apply)
      + zone                = "home.utf9k.net"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/cloudflare/cloudflare"],
│   on providers.tf line 5, in provider "cloudflare":
│    5:   account_id = var.cloudflare_account_id
│ 
│ Use resource specific `account_id` attributes instead.
╵
╷
│ Warning: Attribute Deprecated
│ 
│   with provider["registry.terraform.io/cloudflare/cloudflare"],
│   on providers.tf line 5, in provider "cloudflare":
│    5:   account_id = var.cloudflare_account_id
│ 
│ Use resource specific `account_id` attributes instead.
╵

```

</details>